gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK_USER15xx.c

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/TASK.h"
#include "../DL698/RM_TASK.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/RM_Record.h"
#include "../DL698/RM_Event_DL2007.h"

#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../MS/msFILE.h"
#include "../MS/MS.h"
#include "../Calculate/Calculate.h"
#include "../Display/Warning.h"
#include "../DL698/CONGEAL_Record.h"
#include "../DL698/EVENT_Record.h"


extern const DL698_LIB_List_TypeDef SETINIT_601E_List[];



#if (USER/100)==15//安徽系

u32 RM_Meter(u32 PORTn)//当前电能表计数是否要抄;入口:UARTCtrl->MeterCount[],UARTCtrl->TaskID;返回:0=不抄,1=要抄,2=完成,同时填写通信地址,波特率,抄表规约类型
{
	u32 i;
	u32 x;
	u32 id;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	u8* pMS;
	u8 *p8s;
	u8* p8d;
	RMokfailLIST_TypeDef *rmOKFAILlist;
	UARTCtrl_TypeDef *UARTCtrl;

	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	id=UARTCtrl->TaskID;
	if(id==0)
	{
		return 0;
	}
	i=(id>>8)&0xff;//任务号
	if(i>=(RMTASKmax+ExtRMTASKmax))
	{
		return 0;
	}
	switch(i)//任务号
	{
		case RMTASKnoPOWER://停上电事件固定任务号
			id>>=8;
			id&=0xff;
			i=UARTCtrl->MeterCount[id];
			i=PowerEvent->setno[i];
			p8s=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
			p8s+=5;
			break;
	
		default:
			i=id&0xff;//方案编号
			switch((id>>24)&0xf)//方案类型
			{
				case 1://普通采集方案
					i*=LENper_6014;
					i+=ADDR_6014_SDRAM;
					p8s=(u8*)i;
					if(p8s[0]!=DataType_structure)
					{
						return 0;
					}
					pMS=Get_Element(p8s,5,0,0);//计算元素地址,使用ADDR_128KDATABUFF
					if(pMS==0)
					{
						return 0;
					}
					id>>=8;
					id&=0xff;
					pMS++;//指向数据类型后的字节
					i=Compare_SETNO_MS((u8*)ADDR_6000_SDRAM,UARTCtrl->MeterCount[id],pMS);//比较配置序号是否符合MS集合,入口:pADDR_6000已在RAM,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
					if(i==0)
					{
						return 0;
					}
					p8s=(u8*)ADDR_6000_SDRAM+(UARTCtrl->MeterCount[id]*LENper_6000);
					p8s+=5;
					break;
				case 2://事件采集方案
					i*=LENper_6016;
					i+=ADDR_6016_SDRAM;
					p8s=(u8*)i;
					if(p8s[0]!=DataType_structure)
					{
						return 0;
					}
					pMS=Get_Element(p8s,3,0,0);//计算元素地址,使用ADDR_128KDATABUFF
					if(pMS==0)
					{
						return 0;
					}
					id>>=8;
					id&=0xff;
					pMS++;//指向数据类型后的字节
					i=Compare_SETNO_MS((u8*)ADDR_6000_SDRAM,UARTCtrl->MeterCount[id],pMS);//比较配置序号是否符合MS集合,入口:pADDR_6000已在RAM,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
					if(i==0)
					{
						return 0;
					}
					p8s=(u8*)ADDR_6000_SDRAM+(UARTCtrl->MeterCount[id]*LENper_6000);
					p8s+=5;
					break;
				case 3://透明方案
		#if LENper_6018>LEN_128KDATABUFF
			#error
		#endif
					i*=LENper_6018;
					i+=ADDR_6018;
					MR(ADDR_128KDATABUFF,i,LENper_6018);
					p8s=(u8*)ADDR_128KDATABUFF;
					if(p8s[0]!=DataType_structure)
					{
						return 0;
					}
					id>>=8;
					id&=0xff;
					i=Get_DL698ByteTypeLenValue(p8s+5);//得到DL698字节类型长度单元的值
					if(UARTCtrl->MeterCount[id]>=i)
					{
						UARTCtrl->MeterCount[id]=NUM_RMmax;
						return 0;
					}
					p8s=Get_Element(p8s+4,UARTCtrl->MeterCount[id]+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
					if(p8s==0)
					{
						return 0;//返回:0=不抄,1=要抄,2=完成
					}
					//透明方案地址
					p8s+=1;
					//按通信地址找配置序号
					p8d=(u8*)ADDR_6000_SDRAM;
					for(i=0;i<NUMmax_6000;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							x=Compare_octet_string(p8s,p8d+8);//比较字节串,p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
							if(x==0)
							{
								break;
							}
							
						}
						p8d+=LENper_6000;
					}
					if(i>=NUMmax_6000)
					{
						return 0;
					}
					p8s=p8d+2;
		//			UARTCtrl->MeterSetNo=i;//配置序号
					break;
				case 4://上报方案
					
				case 5://脚本方案
					break;
				default:
					break;
			}
			break;
	}
	//端口
	p8d=Get_Element(p8s,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
	if(p8d==0)
	{
		return 0;
	}
	x=(p8d[1]<<24)+(p8d[2]<<16)+(p8d[3]<<8)+p8d[4];//端口OAD
	x=OADtoPORTn(x);
	if(x!=PORTn)
	{
		return 0;
	}
	//通信地址
	p8s+=3;
	Addr0=p8s[2]|(p8s[3]<<8);
	Addr1=p8s[4]|(p8s[5]<<8);
	Addr2=p8s[6]|(p8s[7]<<8);
	if(UARTCtrl->RMMeterCountAuto==0)//抄表电能表自动加1计数,0=自动,1=不自动(路由模块主动)
	{
		UARTCtrl->RMAddr[0]=Addr0;
		UARTCtrl->RMAddr[1]=Addr1;
		UARTCtrl->RMAddr[2]=Addr2;
	}
	x=UARTCtrl->NUMrmOK[id];//任务已采集完成数
	if(x>=NUM_RMmax)
	{
		x=NUM_RMmax;
	}
	rmOKFAILlist=UARTCtrl->rmOKFAILlist[id];
	while(x--)
	{
		if(Addr0==rmOKFAILlist->Addr0)
		{
			if(Addr1==rmOKFAILlist->Addr1)
			{
				if(Addr2==rmOKFAILlist->Addr2)
				{
					return 2;//返回:0=不抄,1=要抄,2=完成
				}
			}
		}
		rmOKFAILlist++;
	}
	x=p8s[0];
	x++;
	//波特率
	p8s+=x;
	p8s++;
	i=p8s[0];
	switch(i)
	{
		case 0://300
		case 1://600
		case 2://1200
		case 3://2400
		case 4://4800
		case 5://7200
		case 6://9600
		case 7://19200
		case 8://38400
		case 9://57600
		case 10://115200
			if(PORTn!=RS485_4PORT)
			{//不是载波口
				UARTCtrl->BpsCtrl=(0xb+(i<<5));
			}
			break;
		case 255://自适应
		default:
			if(PORTn!=RS485_4PORT)
			{//不是载波口
				UARTCtrl->BpsCtrl=RS485DefaultBPS;//RS485口默认的速率控制码0=300,1=600,2=1200,3=2400,4=4800,5=7200,6=9600,7=19200,8=38400,9=57600,10=115200,11=230400,12=...
			}
			break;
	}
	//规约类型
	if(PORTn==ACSAMPLEPORT)
	{//内部交采
	#if iMeterProtocol==2//内部交采抄表规约:2=DL/T645-2007，3=DL/T698.45
		UARTCtrl->RMprotocol=2;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
	#else
		UARTCtrl->RMprotocol=3;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
	#endif
		return 1;//返回:0=不抄,1=要抄,2=完成
	}
	p8s+=2;
	i=p8s[0];
	UARTCtrl->RMprotocol=i;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
	return 1;//返回:0=不抄,1=要抄,2=完成
}

u8* RM_CSD(u32 PORTn)//取抄表数据标识CSD;返回:0=无效,1=CSD在URATCtrl,其他值=透明抄读帧数据指针
{
	u32 i;
	u32 n;
	u32 x;
	u32 id;
	u32 Len;
	u32 LEN_CSD;
	u32 OAD;
	u32 ROAD;
	u8* p8s;
	u8* p8d;
	u32* p32;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	id=UARTCtrl->TaskID;
	if(id==0)
	{
		return 0;
	}
	i=(id>>8)&0xff;//任务号
	switch(i)
	{
		case RMTASKnoPOWER://停上电事件固定任务号
			UARTCtrl->RMCSDCountMax=1;//抄表CSD最大个数
			if(UARTCtrl->RMCSDSubCount==0)//抄表CSD子计数
			{
				UARTCtrl->RMCSD[0]=DataType_CSD;
				UARTCtrl->RMCSD[1]=0;//OAD
				UARTCtrl->RMCSD[2]=0x30;
				UARTCtrl->RMCSD[3]=0x11;
				UARTCtrl->RMCSD[4]=0x02;
				UARTCtrl->RMCSD[5]=0x01;
				UARTCtrl->RMCSD[6]=0;//RCSD，SEQUENCE OF个数
//				UARTCtrl->RMCSD[0]=DataType_CSD;
//				UARTCtrl->RMCSD[1]=1;//ROAD
//				UARTCtrl->RMCSD[2]=0x30;
//				UARTCtrl->RMCSD[3]=0x11;
//				UARTCtrl->RMCSD[4]=0x02;
//				UARTCtrl->RMCSD[5]=0x00
//				UARTCtrl->RMCSD[6]=0;//RCSD，SEQUENCE OF个数
				switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
				{
					default:
					case 1://DL/T645-1997
						return 0;
					case 2://DL/T645-2007
						UARTCtrl->RM_DI=0x03110001;//(上1次)掉电发生时刻，结束时刻
						break;
					case 3://DL/T698.45（3）
						break;
				}
				return (u8*)1;
			}
			return 0;
	}
	
